cf_billing/DataProcessors/бестРаботаСОбращениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестРаботаСОбращениями</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестЭтапыОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЭтапыОбращений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестОбращения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестЭтапыОбращений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЭтапыОбращенийЮрЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЭтапыОбращенийЮрЛиц</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестОбращения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестЭтапыОбращений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/бестРаботаСОбращениями/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПросроченныеЗадачи(Организация = Неопределено, Абонент = Неопределено, Контрагент = Неопределено, Договор = Неопределено) Экспорт 
	// Отбираем обращения с сроком окончания этапа меньше текущей даты и при этом не берем в расчет заявки со статусом "ЗакрытиеОбращения"
	// У каждого регистратора должна быть запись со следующим этапом с записью в измерении "Обращение"
	// Если такой записи нет то задача просрочена
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЭтапыОбращений.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ОбращенияСрокМеньшеТекующейДаты
		|ИЗ
		|	РегистрСведений.бестЭтапыОбращений КАК бестЭтапыОбращений
		|ГДЕ
		|	бестЭтапыОбращений.СрокОкончанияЭтапа < &Дата
		|	И бестЭтапыОбращений.Этап <> &ЭтапЗакрытия
		|	И бестЭтапыОбращений.Организация = &Организация
		|	И бестЭтапыОбращений.Абонент = &Абонент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЭтапыОбращенийЮрЛиц.Регистратор
		|ИЗ
		|	РегистрСведений.бестЭтапыОбращенийЮрЛиц КАК бестЭтапыОбращенийЮрЛиц
		|ГДЕ
		|	бестЭтапыОбращенийЮрЛиц.СрокОкончанияЭтапа < &Дата
		|	И бестЭтапыОбращенийЮрЛиц.Этап <> &ЭтапЗакрытия
		|	И бестЭтапыОбращенийЮрЛиц.Организация = &Организация
		|	И бестЭтапыОбращенийЮрЛиц.Контрагент = &Контрагент
		|	И бестЭтапыОбращенийЮрЛиц.Договор = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ЗакрытыеОбращения
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЭтапыОбращений КАК бестЭтапыОбращений
		|		ПО ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор = бестЭтапыОбращений.Обращение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЭтапыОбращенийЮрЛиц КАК бестЭтапыОбращенийЮрЛиц
		|		ПО ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор = бестЭтапыОбращенийЮрЛиц.Обращение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор КАК Регистратор
		|ИЗ
		|	ВТ_ОбращенияСрокМеньшеТекующейДаты КАК ВТ_ОбращенияСрокМеньшеТекующейДаты
		|ГДЕ
		|	НЕ ВТ_ОбращенияСрокМеньшеТекующейДаты.Регистратор В
		|				(ВЫБРАТЬ
		|					ВТ_ЗакрытыеОбращения.Регистратор КАК Регистратор
		|				ИЗ
		|					ВТ_ЗакрытыеОбращения КАК ВТ_ЗакрытыеОбращения)";
	
	Запрос.УстановитьПараметр("Дата"			, ТекущаяДата());
	Запрос.УстановитьПараметр("ЭтапЗакрытия"	, Справочники.бестЭтапыОбращений.ЭтапОбращений_ЗакрытиеОбращения);
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращений.Организация = &Организация","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Организация = &Организация","");
	Иначе 
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если Абонент = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращений.Абонент = &Абонент","");		
	Иначе 
		Запрос.УстановитьПараметр("Абонент", Абонент);
	КонецЕсли;
	
	Если Контрагент = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Контрагент = &Контрагент","");
	Иначе 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	
	Если Договор = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И бестЭтапыОбращенийЮрЛиц.Договор = &Договор","");
	Иначе 
		Запрос.УстановитьПараметр("Договор", Договор);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
